[
  {
    "date": "2025-01-25",
    "title": "Cracking the Code to Careers",
    "description": "The CGPT Cell, in collaboration with IEDC and IIC of AWH Engineering College, organized an alumni interaction program titled “Cracking the Code to Careers” on January 23, 2025. The session, held for final and pre-final year CSE students, focused on corporate work culture, industry expectations, and key career skills.",
    "image": "https://alcorfund.com/wp-content/uploads/2020/09/Technical-Innovation-defination.png",
    "link": "https://awhplacementcell.medium.com/alumni-interaction-program-cracking-the-code-to-careers-fe101402e39e",
    "authors": ["Muralikrishnan"]
  },
  {
    "date": "2024-11-28",
    "title": "Code to Commerce: Your Startup Journey",
    "description": "The Career Guidance, Training, and Placement Cell, in collaboration with Udyama 1.0, IEDC, and IIC, organized a career awareness session, “From Code to Commerce,” for first-year Computer Science and MCA students of AWH Engineering College. The session, led by Mr. Muhammed Swalih M.P. and Mr. Fahal Salam N., founders of Fluxion IT Solutions, focused on career readiness and launching successful software startups.",
    "image": "https://alcorfund.com/wp-content/uploads/2020/09/Technical-Innovation-defination.png",
     "link": "https://awhplacementcell.medium.com/career-awareness-session-from-code-to-commerce-a-deep-dive-into-launching-your-software-startup-3b2d7dfcac27",
    "authors": ["Muralikrishnan"]
  },
  {
    "date": "2024-08-19",
    "title": "Entrepreneurial Session Organized by IIC and IEDC",
    "description": "The Institution’s Innovation Council (IIC) and IEDC of AWH Engineering College hosted an inspiring session, “Our Entrepreneurial Journey,” featuring Mr. Sathyarth Sankar, Mr. Sidharth C, and Mr. Joseph Jones, founders of Borcom Dynamics Pvt. Ltd., a Kozhikode-based startup specializing in Robotic Process Automation (RPA)",
    "image": "https://alcorfund.com/wp-content/uploads/2020/09/Technical-Innovation-defination.png",
     "link": "https://awhplacementcell.medium.com/entrepreneurial-session-organized-by-iic-and-iedc-at-awh-engineering-college-dea80b09f066",
    "authors": ["Muralikrishnan"]
  }
]
